using CompScienceMeshes
export k3_cf, k3_ce

function k3_cf(η1, η2, η3, ξ)

	η1 = cartesian(η1)[1]
	η2 = cartesian(η2)[1]
	η3 = cartesian(η3)[1]
	ξ =  cartesian(ξ)[1]

	(ξ^3)*((η1)^2)*(η2)*(

	k2_cf((ξ, ξ-ξ*η1+ξ*η1*η2), (ξ-ξ*η1*η2*η3, ξ-ξ*η1)) +

	k2_cf((ξ-ξ*η1*η2*η3, ξ-ξ*η1), (ξ, ξ-ξ*η1+ξ*η1*η2)) +

	k2_cf((ξ, ξ*η1*(1-η2+η2*η3)), (ξ-ξ*η1*η2, ξ*η1*(1-η2))) +

	k2_cf((ξ-ξ*η1*η2, ξ*η1*(1-η2)), (ξ, ξ*η1*(1-η2+η2*η3))) +

	k2_cf((ξ-ξ*η1*η2*η3, ξ*η1*(1-η2*η3)), (ξ, ξ*η1*(1-η2))) +

	k2_cf((ξ, ξ*η1*(1-η2)), (ξ-ξ*η1*η2*η3, ξ*η1*(1-η2*η3)))

	)
end
